; domain
(define (domain logistica-actividad)
  (:requirements :strips :typing)
  
  (:types ; 
    paquete camion localizacion - object
  )
  
  (:predicates
    (en-paquete ?p ?l)      ; El paquete ?p está en la localización ?l
    (en-camion ?c ?l)       ; El camión ?c está en la localización ?l
    (paquete-en-camion ?p ?c) ; El paquete ?p está dentro del camión ?c
    (conectado ?l1 ?l2)     ; La localización ?l1 está conectada con ?l2
  )

  (:action mover
    :parameters (?c ?desde ?hacia)
    :precondition (and (en-camion ?c ?desde) (conectado ?desde ?hacia))
    :effect (and (not (en-camion ?c ?desde)) (en-camion ?c ?hacia))
  )

  (:action cargar
    :parameters (?p ?c ?l)
    :precondition (and (en-paquete ?p ?l) (en-camion ?c ?l))
    :effect (and (not (en-paquete ?p ?l)) (paquete-en-camion ?p ?c))
  )

  (:action descargar
    :parameters (?p ?c ?l)
    :precondition (and (paquete-en-camion ?p ?c) (en-camion ?c ?l))
    :effect (and (not (paquete-en-camion ?p ?c)) (en-paquete ?p ?l))
  )
)

; problem
(define (problem problema-logistica-1)
  (:domain logistica-actividad)

  (:objects
    paquete1 - paquete
    camion1 - camion
    ciudad1 ciudad2 ciudad3 ciudad4 - localizacion
  )

  (:init
    ; Estado inicial del problema
    (en-paquete paquete1 ciudad1)
    (en-camion camion1 ciudad2)

    ; Conexiones entre ciudades (bidireccionales)
    (conectado ciudad1 ciudad2)
    (conectado ciudad2 ciudad1)
    (conectado ciudad2 ciudad3)
    (conectado ciudad3 ciudad2)
    (conectado ciudad1 ciudad4)
    (conectado ciudad4 ciudad1)
    (conectado ciudad3 ciudad4)
    (conectado ciudad4 ciudad3)
  )

  (:goal
    (and (en-paquete paquete1 ciudad3))
  )
)

; plan
1. (mover camion1 ciudad2 ciudad1)
   deleted: (en-camion camion1 ciudad2)
   added: (en-camion camion1 ciudad1)
   goals met: 0 of 1
2. (cargar paquete1 camion1 ciudad1)
   deleted: (en-paquete paquete1 ciudad1)
   added: (paquete-en-camion paquete1 camion1)
   goals met: 0 of 1
3. (mover camion1 ciudad1 ciudad2)
   deleted: (en-camion camion1 ciudad1)
   added: (en-camion camion1 ciudad2)
   goals met: 0 of 1
4. (mover camion1 ciudad2 ciudad3)
   deleted: (en-camion camion1 ciudad2)
   added: (en-camion camion1 ciudad3)
   goals met: 0 of 1
5. (descargar paquete1 camion1 ciudad3)
   deleted: (paquete-en-camion paquete1 camion1)
   added: (en-paquete paquete1 ciudad3)
   goals met: 1 of 1
